export const careerData = [
    {
        period: '2023.06 ~ 2023.07',
        team: '단독 개발 (1인)',
        title: '하프코 전시 참가 신청 시스템 리뉴얼',
        txt: ['하프코 전시 참가 신청 프로그램 리뉴얼', '화면 개선 및 할인제도 변경, 번역 이슈 대응'],
        role: ['하프코 2024년도 개최에 맞게 화면 개선', '할인제도 변경 개발', '크롬 자체 번역 기능 오류 해결'],
        skill: ['Angular.js', 'PHP']
    },
    {
        period: '2023.04 ~ 2023.07',
        team: '개발 2명 구성',
        title: '소전서림 도서관 예약 시스템 어플',
        txt: ['소전서림 앱 유지보수', '도서관 이용 및 강연 예약 앱'],
        role: ['이용권 상품 구매 관련 유지보수', '업데이트 시 업데이트 버전 알림창 개발'],
        skill: ['React-native', 'Spring']
    },
    {
        period: '2023.04 ~ 2023.07',
        team: '개발 3명으로 구성',
        title: '제품검사 관리자 페이지/홈페이지 리뉴얼',
        txt: ['제품검사 관리자 페이지/홈페이지 React로 리뉴얼', '냉동기, 냉동설비, 강도확인 검사를 관리해주는 프로그램'],
        role: ['관리자 페이지 cms, 시스템 관리 등 데이터 관리 개발', '냉동기, 냉동설비, 강도확인 데이터 ag-grid 리스트 바인딩', '제품별 검사처리 기능 개발', '관리자 페이지 엑셀 다운로드 기능 개발', '홈페이지 회원가입 시 pass 인증 개발'],
        skill: ['React', 'PHP']
    },
    {
        period: '2023.02 ~ 2023.07',
        team: '단독 개발 (1인)',
        title: '냉난방공조산업 서비스 안내 프로그램',
        txt: ['냉난방공조산업 서비스 안내 프로그램', '결제 시스템 개선 및 관리자 페이지 유지보수'],
        role: ['결제 시스템 업데이트 개발', '관리자 페이지 유지보수'],
        skill: ['Angular', 'PHP']
    },
    {
        period: '2023.01 ~ 2023.02(앱) / 2023.02 ~ 2023.03(웹)',
        team: '단독 개발 (1인)',
        title: '가정용 에어컨 설치 예약 시스템 (앱/웹)',
        txt: ['가정용 에어컨 설치 예약 시스템 개발', '홈페이지 예약/소셜 로그인, 설치기사 앱 이력 처리, 카메라 플러그인 적용'],
        role: ['홈페이지 로그인/소셜 로그인 기능 개발', '에어컨 설치 예약 기능 개발', '회원가입 시 자격인증 처리 개발', '설치기사 이력등록/신청정보 확인 앱 개발', 'React capacitor 카메라 플러그인을 활용해 카메라 컴포넌트 개발'],
        skill: ['React(웹)', 'React ionic(앱)', 'PHP']
    },
    {
        period: '2022.10 ~ 2022.11',
        team: '개발 2명으로 구성',
        title: '바이크마켓 오토바이 중고거래 앱',
        txt: ['고객간의 오토바이/오토바이 용품을 사고 파는 앱'],
        role: ['로그인/소셜로그인 개발', 'ionic 카메라 플러그인을 이용해 오토바이 매물 등록 처리 개발', '카카오 현재위치 api 활용하여 현재위치 설정 기능 개발'],
        skill: ['Angular ionic', 'PHP']
    },
    {
        period: '2021.09 ~ 2021.11(android) / 2022.08 ~ 2022.09(ios)',
        team: '개발 5명으로 구성',
        title: '사주풀이 작명 앱',
        txt: ['고객에게 이름을 추천 및 사주풀이 하는 앱'],
        role: ['소셜 로그인 기능 개발(IOS는 애플 로그인 기능 개발)', '작명 이름짓기 상품권 등록 / 보관함 기능 개발', '이름짓기(기본형) UI 개발', 'ionic 인앱결제 플러그인을 사용하여 ios 인앱결제 개발'],
        skill: ['Angular ionic', 'PHP']
    },
    {
        period: '2022.03 ~ 2023.07',
        team: '개발 3명으로 구성',
        title: '한국에너지기기산업진흥회 관리자 페이지',
        txt: ['직원정보 관리 및 문서 기능, 에너지기기 검사 관리 시스템'],
        role: ['직원정보 관리 스케쥴 달력 시스템 구축', '전자결재 프로세스 개발', '공문서 접수/시행대장 프로세스 개발', 'DirectSend php를 활용하여 SMS 발송기능 개발', '에너지기기제품 시험검사 견적서 개발'],
        skill: ['Angular', 'PHP']
    },
    {
        period: '2021.05 ~ 2021.11(1차) / 2022.02 ~ 2023.06(2차)',
        team: '개발 3명으로 구성',
        title: '퓨쳐시스템 보안 관리 툴',
        txt: ['퓨쳐시스템 보안 관리 툴 관리자 웹 개발 1차, 2차'],
        role: ['시스템 진단, 정보 등 시스템 관리 개발', '방화벽 관리 기능 개발', '전반적인 관리 툴 FrontEnd 개발'],
        skill: ['React']
    },
    {
        period: '2022.01 ~ 2022.06',
        team: '개발 2명으로 구성',
        title: '문화센터 회원 관리 시스템 프로그램',
        txt: ['문화센터 회원 관리 시스템 관리 프로그램'],
        role: ['회원정보수정, 회원 휴면계정 처리 등 회원관리 시스템 구축', '강사 관리, 예약 처리 등의 기능 개발', '대관 시스템 개발', 'DirectSend php를 활용하여 SMS 발송 기능 개발'],
        skill: ['React', 'Spring']
    },
    {
        period: '2021.11 ~ 2021.12',
        team: '개발 2명으로 구성',
        title: '심플솔루션 보안 관리자 웹 개발',
        txt: ['심플솔루션 보안 관리자 웹 개발'],
        role: ['보안 차트 그래프 기능 개발', '전반적인 보안 관리 툴 FrontEnd 개발'],
        skill: ['React']
    },
    {
        period: '2021.01 ~ 2021.06',
        team: '개발 4명으로 구성',
        title: '바이크마트 쇼핑몰/관리자 웹 개발',
        txt: ['바이크마트 쇼핑몰/관리자 웹 개발'],
        role: ['쇼핑몰 로그인/회원가입 기능 구현', '쇼핑몰 주문관리 프로세스, 장바구니 관리 등의 기능 개발', '관리자 페이지 주문 환불 기능 개발', '관리자 페이지 사방넷 주문관리 개발'],
        skill: ['Angular', 'PHP']
    },
]
