export const careerData = [
    {
        period: '2023.06 ~ 2023.07',
        txt: ['개발 1명으로 구성', '하프코 2023 -> 2024년도 개최로 리뉴얼', '하프코 전시 참가 신청 프로그램'],
        role: ['하프코 2024년도 개최에 맞게 화면 개선', '할인제도 변경 개발', '영어 번역기 기능 개발'],
        skill: ['Angular.js', 'PHP']
    },
    {
        period: '2023.04 ~ 2023.07',
        txt: ['개발 2명 구성', '소전서림 앱 유지보수', '도서관 이용 및 강연 예약 앱'],
        role: ['이용권 상품 구매 관련 유지보수', '업데이트 시 업데이트 알림창 개발'],
        skill: ['React-native', 'Spring']
    },
    {
        period: '2023.04 ~ 2023.07',
        txt: ['개발 3명으로 구성', '제품검사 관리자 페이지/홈페이지 React로 리뉴얼', '냉동기, 냉동설비, 강도확인 검사를 관리해주는 프로그램'],
        role: ['관리자 페이지 데이터 연동 개발', '제품별 검사처리 기능 개발', '홈페이지 회원가입 시 pass 인증 개발'],
        skill: ['React', 'PHP']
    },
    {
        period: '2023.02 ~ 2023.07',
        txt: ['개발 1명으로 구성', '냉난방공조산업 서비스 안내 프로그램'],
        role: ['결제 시스템 업데이트 개발', '관리자 페이지 유지보수'],
        skill: ['Angular', 'PHP']
    },
    {
        period: '2023.01 ~ 2023.02(앱) / 2023.02 ~ 2023.03(웹)',
        txt: ['개발 1명으로 구성', '가정용 에어컨 설치 시스템 React로 개발', '홈페이지에서 고객이 에어컨 설치기사 예약', '설치기사 앱에서 설치기사가 이력 확인 처리'],
        role: ['홈페이지 로그인/소셜 로그인 기능 개발', '에어컨 설치 예약 기능 개발', '회원가입 시 자격인증 처리 개발', '설치기사 이력등록/신청정보 확인 앱 개발'],
        skill: ['React(웹)', 'React ionic(앱)', 'PHP']
    },
    {
        period: '2022.10 ~ 2022.11',
        txt: ['개발 2명으로 구성', '오토바이 중고거래 앱 개발', '고객간의 오토바이/오토바이 용품을 사고 파는 앱'],
        role: ['로그인/소셜 로그인 기능 개발', '카메라 기능 개발', '현재위치 설정 기능 개발', '매몰 등록 처리 개발'],
        skill: ['Angular ionic', 'PHP']
    },
    {
        period: '2021.09 ~ 2021.11(android) / 2022.08 ~ 2022.09(ios)',
        txt: ['개발 5명으로 구성', '사주풀이 작명 앱 개발', '고객에게 이름을 추천 및 사주풀이 하는 앱'],
        role: ['소셜 로그인 기능 개발', '상품권 등록/보관함 기능 개발', '이름짓기(기본형) 페이지 개발', 'ios 인앱 결제 개발'],
        skill: ['Angular ionic', 'PHP']
    },
    {
        period: '2022.03 ~ 2023.07',
        txt: ['개발 3명으로 구성', '한국에너지기기산업진흥회 관리자 페이지', '직원정보 관리 및 문서 기능, 에너지기기 검사 관리 시스템'],
        role: ['달력 스케쥴 개발', '전자결재 프로세스 개발', '공문서 접수/시행대장 프로세스 개발', 'SMS 발송 기능 개발', '에너지기기제품 시험검사 견적서 개발'],
        skill: ['Angular', 'PHP']
    },
    {
        period: '2021.05 ~ 2021.11(1차) / 2022.02 ~ 2023.06(2차)',
        txt: ['프론트앤드 개발 3명으로 구성', '퓨쳐시스템 보안 관리 툴 관리자 웹 개발 1차, 2차'],
        role: ['시스템 진단, 정보 등 시스템 관리 개발', '방화벽 관리 기능 개발', '전반적인 관리 툴 FrontEnd 개발'],
        skill: ['React']
    },
    {
        period: '2022.01 ~ 2022.06',
        txt: ['개발 2명으로 구성', '문화센터 회원 관리 시스템 관리 프로그램'],
        role: ['회원 관리 시스템 개발', '강사 관리 개발', '대관 시스템 개발', 'SMS 발송 기능 개발'],
        skill: ['React', 'Spring']
    },
    {
        period: '2021.11 ~ 2021.12',
        txt: ['프론트앤드 개발 2명으로 구성', '심플솔루션 보안 관리자 웹 개발'],
        role: ['보안 차트 그래프 기능 개발', '전반적인 보안 관리 툴 FrontEnd 개발'],
        skill: ['React']
    },
    {
        period: '2021.11 ~ 2021.12',
        txt: ['프론트앤드 개발 4명으로 구성', '심플솔루션 보안 관리자 웹 개발'],
        role: ['로그인/회원가입 기능 구현', '쇼핑몰 주문관리 프로세스 개발', '환불 기능 개발', '오픈마켓 주문관리 개발'],
        skill: ['Angular', 'PHP']
    },
]
